In [10]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
%sql postgresql://postgres:12345678@127.0.0.1/youtubedb

'Connected: postgres@youtubedb'

In [12]:
%sql SELECT * FROM videoplay_fact LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[('a3bfcff2a97547d3aa1bf0230ed0ea65', '2018-11-11', '69', 'free', None, None, '455', 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 ('9be2a73206dc4c09822f4e7d618663ed', '2018-11-11', '69', 'free', None, None, '455', 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 ('9c80bae3807c4ffb903d000c542f3a18', '2018-11-11', '69', 'free', None, None, '455', 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 ('e52381cd71974da1a1d841d7df71eb2f', '2018-11-11', '32', 'free', None, None, '456', 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 ('27ca1589585047159e78a107f39ad264', '2018-11-11', '32', 'free', None, None, '456', 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [13]:
%sql SELECT * FROM users_dim LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[('69', 'Anabelle', 'Simpson', 'F', 'free'),
 ('32', 'Lily', 'Burns', 'F', 'free'),
 ('75', 'Joseph', 'Gutierrez', 'M', 'free'),
 ('92', 'Ryann', 'Smith', 'F', 'free'),
 ('49', 'Chloe', 'Cuevas', 'F', 'free')]

In [14]:
%sql SELECT * FROM videos_dim LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', '1982', '233.40363'),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', '1984', '269.81832'),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', '2007', '209.60608'),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', '0', '189.57016'),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', '0', '218.77506')]

In [16]:
%sql SELECT * FROM youtubers_dim LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', 'NaN', 'NaN'),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', 'NaN', 'NaN'),
 ('ARXR32B1187FB57099', 'Gob', '', 'NaN', 'NaN'),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', 'NaN', 'NaN'),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', '35.21962', '-80.01955')]

In [17]:
%sql SELECT * FROM time_dim LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/youtubedb
5 rows affected.

[('2018-11-11', '02', '11', '45', '11', '2018', '0'),
 ('2018-11-23', '00', '23', '47', '11', '2018', '5'),
 ('2018-11-18', '02', '18', '46', '11', '2018', '0'),
 ('2018-11-04', '00', '04', '44', '11', '2018', '0'),
 ('2018-11-01', '20', '01', '44', '11', '2018', '4')]

## REMEMBER: Restart this notebook to close connection to `youtubedb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `extract_transform_load.py`, or `extract_transform_load.ipynb` files since you can't make multiple connections to the same database (in this case, youtubedb).